#!/usr/bin/perl -p

# 这程序是用来对 debian-zh-faq 中文版从繁体转为简体后作出的“善后处理”。
#
# 作者：霍东灵 Anthony Fok <foka@debian.org>
#
# 请把文件从 Big5 转码为 GB2312 后，才运行这个程序。

next if /^%/;

while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)—/$1─/) {}
while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)「/$1“/) {}
while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)」/$1”/) {}
while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*(?:、|，|。|：|；|！|？))~/$1/) {}
while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)(?<!\<\<)著(?!\>\>)/$1着/) {}
while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)\<\<著\>\>/$1著/) {}

s/软件套件/软件包/g; s/套件/软件包/g;

s/(纯)?文字档(案)?/文本文件/g;
s/文字(?=模式|编辑)/文本/g;
s/档案管理员/文件管理器/g;
s/档案系统/文件系统/g;
s/预设值/缺省值/g;
s/列表机/打印机/g;
s/记忆体/内存/g;
s/字元提示器/提示符/g;

s/X~视窗/X~窗口/g;
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*(软|硬))体/$1件/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)(?<!方)程式/$1程序/);
# 1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)核心/$1内核/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)内核/$1核心/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)模组/$1模块/);
# 1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)支援/$1支持/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)以太(?=网)/$1乙太/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*(软|硬|光|磁|Zip~))碟/$1盘/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)磁片/$1软盘/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)相容/$1兼容/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)电脑/$1计算机/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)(?<!\<s\<)档案(?!>>)/$1文件/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)资讯/$1信息/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)字型/$1字体/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)萤幕/$1屏幕/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)游标/$1光标/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)滑鼠/$1鼠标/);
s/通信论坛/邮件列表/g;
s/作业系统/操作系统/g;
s/视窗系统/窗口系统/g;
s/设定档/配置文件/g;
s/档案名称/文件名/g;
s/映射站/镜像站/g;

s/伺服器/服务器/g;
# hashao 有时把 "server" 叫作 "服侍器" ……
s/服侍器/服务器/g;
# Riser 把 "server" 叫作 "服侍器" ……
s/服务程序/服务器/g;

s/\<s\<(.+?)\>\>/$1/g;
s/\<t\<文件\>\>/文档/g;
s/\<t\<延伸\>\>/扩展/g;
s/\<t\<预设\>\>/默认/g;
s/\<t\<支援\>\>/支持/g;


# 结束


sub changewww () {

s/起动磁碟/引导盘/g;

1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)「/$1“/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)」/$1”/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)『/$1“/);
1 while (s/^((?:[\x00-\x7F]|[\x80-\xFF].)*)』/$1”/);

}
